# 第1章 Pandas基础

In [1]:
import pandas as pd
import numpy as np

#### 查看Pandas版本
np.__version__
pd.__version__

## 一、文件读取与写入
### 1. 读取
#### （a）csv格式

In [3]:
df = pd.read_csv('./datas/table.csv')
df.head() #取前5行
#dataframe和series的区别简单来讲，dataframe是一个二维表，而series是一个一维数据

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [4]:
df.columns#查看列名

Index(['School', 'Class', 'ID', 'Gender', 'Address', 'Height', 'Weight',
       'Math', 'Physics'],
      dtype='object')

In [5]:
df.index#查看索引

RangeIndex(start=0, stop=35, step=1)

In [6]:
df.dtypes #查看每个字段的数据类型

School      object
Class       object
ID           int64
Gender      object
Address     object
Height       int64
Weight       int64
Math       float64
Physics     object
dtype: object

#### （b）txt格式

In [7]:
df_txt = pd.read_table('./datas/table.txt',skiprows=[0,2],names=['id','alpha','price','name']) #可设置sep分隔符参数,默认是tab分割
#skiprows=[0,2]跳过第一行和第三行
df_txt.head()#去掉第一行和第三行

   id alpha  price    name
0   2     a    1.4   apple
1   6     c    2.5  orange
2   5     d    3.2   lemon

In [8]:
df_txt = pd.read_table('./datas/table.txt',skiprows=1,names=['id','alpha','price','name']) #可设置sep分隔符参数
df_txt.head()#一共去掉几行

   id alpha  price    name
0   2     a    1.4   apple
1   3     b    3.4  banana
2   6     c    2.5  orange
3   5     d    3.2   lemon

#### （c）xls或xlsx格式

In [9]:
!pip install xlrd

Requirement already satisfied: xlrd in /Users/mac/opt/anaconda3/lib/python3.7/site-packages (1.2.0)

In [10]:
#需要安装xlrd包
#输入 pip install xlrd ,安装xlrd包
df_excel = pd.read_excel('./datas/table.xlsx')
df_excel.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

### 2. 写入

In [11]:
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

#### （a）csv格式

In [12]:
df.to_csv('./datas/new_table.csv')
#df.to_csv('data/new_table.csv', index=False) #保存时除去行索引

#### （b）xls或xlsx格式

In [13]:
#需要安装openpyxl
#!pip install openpyxl 等待安装结束
df.to_excel('./datas/new_table2.xlsx', sheet_name='Sheet1',index=False)

## 二、基本数据结构
### 1. Series
#### （a）创建一个Series

#### 对于一个Series，其中最常用的属性为值（values），索引（index），名字（name），类型（dtype）

In [14]:
s = pd.Series(np.random.randn(5),index=['a','b','c','d','e'],name='这是一个Series',dtype='float64')
s

a    0.567508
b   -1.248783
c   -0.679932
d   -0.965693
e    0.769339
Name: 这是一个Series, dtype: float64

#### （b）访问Series属性

In [15]:
s.values

array([ 0.56750759, -1.24878341, -0.67993196, -0.96569291,  0.76933907])

In [16]:
s.name

'这是一个Series'

In [17]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [18]:
s.dtype

dtype('float64')

#### （c）取出元素
#### 将在后面课程中详细讨论索引的应用，这里先大致了解

In [19]:
s['a']

0.5675075919719482

In [20]:
s[['a','b']]

a    0.567508
b   -1.248783
Name: 这是一个Series, dtype: float64

#### （d）调用方法

In [21]:
s.mean()

-0.31151232324714817

### 2. DataFrame
#### （a）创建一个DataFrame

In [95]:
df = pd.DataFrame({'col1':list('abcde'),'col2':range(5,10),'col3':[1.3,2.5,3.6,4.6,5.8]},
                 index=list('一二三四五'))
df

  col1  col2  col3
一    a     5   1.3
二    b     6   2.5
三    c     7   3.6
四    d     8   4.6
五    e     9   5.8

#### （b）从DataFrame取出一列为Series

In [23]:
df['col1']

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [24]:
df[['col1','col2']]

  col1  col2
一    a     5
二    b     6
三    c     7
四    d     8
五    e     9

In [25]:
type(df[['col1','col2']])

pandas.core.frame.DataFrame

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
type(df['col1'])

pandas.core.series.Series

#### （c）修改行或列名

In [96]:
df.rename(index={'一':'one'},columns={'col1':'new_col1'})

    new_col1  col2  col3
one        a     5   1.3
二          b     6   2.5
三          c     7   3.6
四          d     8   4.6
五          e     9   5.8

#### （d）调用属性和方法

In [97]:
df.index

Index(['一', '二', '三', '四', '五'], dtype='object')

In [30]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [31]:
df.values

array([['a', 5, 1.3],
       ['b', 6, 2.5],
       ['c', 7, 3.6],
       ['d', 8, 4.6],
       ['e', 9, 5.8]], dtype=object)

In [32]:
df.shape

(5, 3)

In [33]:
df.mean() #本质上是一种Aggregation操作，将在后面课程详细介绍

col2    7.00
col3    3.56
dtype: float64

#### （e）索引对齐特性
#### 这是Pandas中非常强大的特性，不理解这一特性有时就会造成一些麻烦

In [34]:
df1 = pd.DataFrame({'A':[1,2,3]},index=[1,2,3])
df2 = pd.DataFrame({'A':[1,2,3]},index=[3,1,2])
print(df1)
print(df2)
print(df1-df2) #由于索引对齐，因此结果不是0

   A
1  1
2  2
3  3
   A
3  1
1  2
2  3
   A
1 -1
2 -1
3  2

#### （f）列的删除与添加
#### 对于删除而言，可以使用drop函数或del或pop

In [35]:
df

  col1  col2  col3
一    a     5   1.3
二    b     6   2.5
三    c     7   3.6
四    d     8   4.6
五    e     9   5.8

In [36]:
df.drop(columns='col1') #会生成一个新的df！如果希望在原来的df进行改变需要传入参数inplace=True

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

In [37]:
df.drop(index='五',columns='col1') #设置inplace=True后会直接在原DataFrame中改动

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6

In [38]:
df['col1']=[1,2,3,4,5]
df

   col1  col2  col3
一     1     5   1.3
二     2     6   2.5
三     3     7   3.6
四     4     8   4.6
五     5     9   5.8

In [39]:
del df['col1']
df

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

#### pop方法直接在原来的DataFrame上操作，且返回被删除的列，与python中的pop函数类似

In [40]:
df['col1']=[1,2,3,4,5]
df.pop('col1')

一    1
二    2
三    3
四    4
五    5
Name: col1, dtype: int64

In [41]:
df

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

#### 可以直接增加新的列，也可以使用assign方法

In [42]:
df1

   A
1  1
2  2
3  3

In [43]:
df1['B']=list('abc')
df1

   A  B
1  1  a
2  2  b
3  3  c

In [44]:
df1.assign(C=pd.Series(list('def'))) #list是从0开始算的
#思考：为什么会出现NaN？（提示：索引对齐）

   A  B    C
1  1  a    e
2  2  b    f
3  3  c  NaN

#### 但assign方法不会对原DataFrame做修改

In [45]:
df1

   A  B
1  1  a
2  2  b
3  3  c

#### （g）根据类型选择列

In [46]:
df

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

In [47]:
df.select_dtypes(include=['number']).head()

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

In [48]:
df.select_dtypes(include=['float']).head()

   col3
一   1.3
二   2.5
三   3.6
四   4.6
五   5.8

#### （h）将Series转换为DataFrame

In [49]:
df

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

In [50]:
s = df.mean() #返回的是一个series对象
s.name='to_DataFrame'
s

col2    7.00
col3    3.56
Name: to_DataFrame, dtype: float64

In [51]:
s.to_frame()

      to_DataFrame
col2          7.00
col3          3.56

#### 使用T符号可以转置

In [52]:
s.to_frame().T

              col2  col3
to_DataFrame   7.0  3.56

## 三、常用基本函数
#### 从下面开始，包括后面所有章节，我们都会用到这份虚拟的数据集

In [53]:
df = pd.read_csv('./datas/table.csv')

### 1. head和tail

In [54]:
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [55]:
df.tail()

   School Class    ID Gender   Address  Height  Weight  Math Physics
30    S_2   C_4  2401      F  street_2     192      62  45.3       A
31    S_2   C_4  2402      M  street_7     166      82  48.7       B
32    S_2   C_4  2403      F  street_6     158      60  59.7      B+
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
34    S_2   C_4  2405      F  street_6     193      54  47.6       B

#### 可以指定n参数显示多少行

In [56]:
df.head(3)

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+

### 2. unique和nunique

#### nunique显示有多少个唯一值

In [57]:
df['Physics'].nunique()

7

#### unique显示所有的唯一值

In [58]:
df['Physics'].unique()

array(['A+', 'B+', 'B-', 'A-', 'B', 'A', 'C'], dtype=object)

### 3. count和value_counts

#### count返回非缺失值元素个数

In [59]:
df['Physics'].count()

35

#### value_counts返回每个元素有多少个

In [60]:
df['Physics'].value_counts()

B+    9
B     8
B-    6
A     4
A+    3
A-    3
C     2
Name: Physics, dtype: int64

### 4. describe和info

#### info函数返回有哪些列、有多少非缺失值、每列的类型

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 9 columns):
School     35 non-null object
Class      35 non-null object
ID         35 non-null int64
Gender     35 non-null object
Address    35 non-null object
Height     35 non-null int64
Weight     35 non-null int64
Math       35 non-null float64
Physics    35 non-null object
dtypes: float64(1), int64(3), object(5)
memory usage: 2.6+ KB

#### describe默认统计数值型数据的各个统计量

In [62]:
df.describe()

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
max    2405.00000  195.000000  100.000000  97.000000

#### 可以自行选择分位数

In [63]:
df.describe(percentiles=[.05, .25, .75, .95])

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
5%     1102.70000  157.000000   56.100000  32.640000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
95%    2403.30000  193.300000   97.600000  90.040000
max    2405.00000  195.000000  100.000000  97.000000

#### 对于非数值型也可以用describe函数

In [64]:
df['Physics'].describe()

count     35
unique     7
top       B+
freq       9
Name: Physics, dtype: object

### 5. idxmax和nlargest
#### idxmax函数返回最大值所在索引，在某些情况下特别适用，idxmin功能类似

In [65]:
df['Math'].idxmax()

5

#### nlargest函数返回前几个大的元素值，nsmallest功能类似

In [66]:
df['Math'].nlargest(3)

5     97.0
28    95.5
11    87.7
Name: Math, dtype: float64

### 6. clip和replace

#### clip和replace是两类替换函数
#### clip是对超过或者低于某些值的数进行截断

In [67]:
df

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
1     S_1   C_1  1102      F  street_2     192      73  32.5      B+
2     S_1   C_1  1103      M  street_2     186      82  87.2      B+
3     S_1   C_1  1104      F  street_2     167      81  80.4      B-
4     S_1   C_1  1105      F  street_4     159      64  84.8      B+
5     S_1   C_2  1201      M  street_5     188      68  97.0      A-
6     S_1   C_2  1202      F  street_4     176      94  63.5      B-
7     S_1   C_2  1203      M  street_6     160      53  58.8      A+
8     S_1   C_2  1204      F  street_5     162      63  33.8       B
9     S_1   C_2  1205      F  street_6     167      63  68.4      B-
10    S_1   C_3  1301      M  street_4     161      68  31.5      B+
11    S_1   C_3  1302      F  street_1     175      57  87.7      A-
12    S_1   C_3  1303      M  street_7     188      82  49.7       B
13    S_1   C_3  1304      M  street_2     195      70  85.2       A
14    S_1   C_3  1305      F  street_5     187      69  61.7      B-
15    S_2   C_1  2101      M  street_7     174      84  83.3       C
16    S_2   C_1  2102      F  street_6     161      61  50.6      B+
17    S_2   C_1  2103      M  street_4     157      61  52.5      B-
18    S_2   C_1  2104      F  street_5     159      97  72.2      B+
19    S_2   C_1  2105      M  street_4     170      81  34.2       A
20    S_2   C_2  2201      M  street_5     193     100  39.1       B
21    S_2   C_2  2202      F  street_7     194      77  68.5      B+
22    S_2   C_2  2203      M  street_4     155      91  73.8      A+
23    S_2   C_2  2204      M  street_1     175      74  47.2      B-
24    S_2   C_2  2205      F  street_7     183      76  85.4       B
25    S_2   C_3  2301      F  street_4     157      78  72.3      B+
26    S_2   C_3  2302      M  street_5     171      88  32.7       A
27    S_2   C_3  2303      F  street_7     190      99  65.9       C
28    S_2   C_3  2304      F  street_6     164      81  95.5      A-
29    S_2   C_3  2305      M  street_4     187      73  48.9       B
30    S_2   C_4  2401      F  street_2     192      62  45.3       A
31    S_2   C_4  2402      M  street_7     166      82  48.7       B
32    S_2   C_4  2403      F  street_6     158      60  59.7      B+
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
34    S_2   C_4  2405      F  street_6     193      54  47.6       B

In [68]:
df['Math'].head()

0    34.0
1    32.5
2    87.2
3    80.4
4    84.8
Name: Math, dtype: float64

In [69]:
df['Math'].clip(33,80).head() #不足33的变为33，大于80的改为80，保留33-80内的数据

0    34.0
1    33.0
2    80.0
3    80.0
4    80.0
Name: Math, dtype: float64

#### replace是对某些值进行替换

In [70]:
df['Address'].head()

0    street_1
1    street_2
2    street_2
3    street_2
4    street_4
Name: Address, dtype: object

In [71]:
df['Address'].replace(['street_1','street_2'],['one','two']).head()

0         one
1         two
2         two
3         two
4    street_4
Name: Address, dtype: object

#### 通过字典，可以直接在表中修改

In [72]:
df.replace({'Address':{'street_1':'one','street_2':'two'}}).head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M       one     173      63  34.0      A+
1    S_1   C_1  1102      F       two     192      73  32.5      B+
2    S_1   C_1  1103      M       two     186      82  87.2      B+
3    S_1   C_1  1104      F       two     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

### 7. apply函数
#### apply是一个自由度很高的函数，在之后我们还要提到
#### 对于Series，它可以迭代每一列的值操作：

In [73]:
df['Math'].apply(lambda x:str(x)+'!').head() #可以使用lambda表达式，也可以使用函数

0    34.0!
1    32.5!
2    87.2!
3    80.4!
4    84.8!
Name: Math, dtype: object

#### 对于DataFrame，它在默认axis=0下可以迭代每一个列操作：

In [74]:
df.apply(lambda x:x.apply(lambda x:str(x)+'!')).head() #这是一个稍显复杂的例子，有利于理解apply的功能

  School Class     ID Gender    Address Height Weight   Math Physics
0   S_1!  C_1!  1101!     M!  street_1!   173!    63!  34.0!     A+!
1   S_1!  C_1!  1102!     F!  street_2!   192!    73!  32.5!     B+!
2   S_1!  C_1!  1103!     M!  street_2!   186!    82!  87.2!     B+!
3   S_1!  C_1!  1104!     F!  street_2!   167!    81!  80.4!     B-!
4   S_1!  C_1!  1105!     F!  street_4!   159!    64!  84.8!     B+!

#### Pandas中的axis参数=0时，永远表示的是处理方向而不是聚合方向，当axis='index'或=0时，对列迭代对行聚合，行即为跨列，axis=1同理

## 四、排序

### 1. 索引排序

In [75]:
df.set_index('Math').head() #set_index函数可以设置索引，将在下一章详细介绍

     School Class    ID Gender   Address  Height  Weight Physics
Math
34.0    S_1   C_1  1101      M  street_1     173      63      A+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
87.2    S_1   C_1  1103      M  street_2     186      82      B+
80.4    S_1   C_1  1104      F  street_2     167      81      B-
84.8    S_1   C_1  1105      F  street_4     159      64      B+

In [76]:
df.set_index('Math').sort_index().head() #可以设置ascending参数，默认为升序，True

     School Class    ID Gender   Address  Height  Weight Physics
Math
31.5    S_1   C_3  1301      M  street_4     161      68      B+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
32.7    S_2   C_3  2302      M  street_5     171      88       A
33.8    S_1   C_2  1204      F  street_5     162      63       B
34.0    S_1   C_1  1101      M  street_1     173      63      A+

### 2. 值排序

In [77]:
df.sort_values(by='Class').head()

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
19    S_2   C_1  2105      M  street_4     170      81  34.2       A
18    S_2   C_1  2104      F  street_5     159      97  72.2      B+
16    S_2   C_1  2102      F  street_6     161      61  50.6      B+
15    S_2   C_1  2101      M  street_7     174      84  83.3       C

#### 多个值排序，即先对第一层排，在第一层相同的情况下对第二层排序

In [78]:
df.sort_values(by=['Address','Height']).head()

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
11    S_1   C_3  1302      F  street_1     175      57  87.7      A-
23    S_2   C_2  2204      M  street_1     175      74  47.2      B-
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
3     S_1   C_1  1104      F  street_2     167      81  80.4      B-

### 2. 练习
#### 【练习一】 现有一份关于美剧《权力的游戏》剧本的数据集，请解决以下问题：
#### （a）在所有的数据中，一共出现了多少人物？
#### （b）以单元格计数（即简单把一个单元格视作一句），谁说了最多的话？
#### （c）以单词计数，谁说了最多的单词？（不是单句单词最多，是指每人说过单词的总数最多，为了简便，只以空格为单词分界点，不考虑其他情况）

In [79]:
df = pd.read_csv('./datas/Game_of_Thrones_Script.csv')
df.head()

,Release Date,Season,Episode,Episode Title,Name,Sentence
0,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,What do you expect? They're savages. One lot s...
1,2011/4/17,Season 1,Episode 1,Winter is Coming,will,I've never seen wildlings do a thing like this...
2,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,How close did you get?
3,2011/4/17,Season 1,Episode 1,Winter is Coming,will,Close as any man would.
4,2011/4/17,Season 1,Episode 1,Winter is Coming,gared,We should head back to the wall.

In [80]:
df['Name'].nunique()

564

In [81]:
df['Name'].value_counts().index[0]

'tyrion lannister'

In [82]:
df_words = df.assign(Words=df['Sentence'].apply(lambda x:len(x.split()))).sort_values(by='Name')
df_words.head()

,Release Date,Season,Episode,Episode Title,Name,Sentence,Words
276,2011/4/17,Season 1,Episode 1,Winter is Coming,a voice,"It's Maester Luwin, my lord.",5
3012,2011/6/19,Season 1,Episode 10,Fire and Blood,addam marbrand,ls it true about Stannis and Renly?,7
3017,2011/6/19,Season 1,Episode 10,Fire and Blood,addam marbrand,Kevan Lannister,2
13610,2014/6/8,Season 4,Episode 9,The Watchers on the Wall,aemon,And what is it that couldn't wait until mornin...,10
13614,2014/6/8,Season 4,Episode 9,The Watchers on the Wall,aemon,"Oh, no need. I know my way around this library...",48

In [83]:
L_count = {}
N_words = list(zip(df_words['Name'],df_words['Words']))
for i in N_words:#(addam marbrand,7)
    if i[0] in L_count.keys():
        L_count[i[0]] = L_count[i[0]] + i[1]
    else:
        L_count[i[0]]= i[1]
# 对字典按value排序
a = sorted(L_count.items(), key=lambda x: x[1], reverse=True)

print(a[0][0])

tyrion lannister